---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerRotationAngle
source: html/2c1fdc0c-6baa-b820-bea8-113bf6375fa4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerRotationAngle Property

"Coupler Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerRotationAngle { get; }
```